GopalSaraf/Practicals/PSDL/include/proc/pic18lf4480.inc
// Register: RXF9SIDL
#define RXF9SIDL RXF9SIDL
RXF9SIDL                                 equ 0D71h
// bitfield definitions
RXF9SIDL_EID16_POSN                      equ 0000h
RXF9SIDL_EID16_POSITION                  equ 0000h
RXF9SIDL_EID16_SIZE                      equ 0001h
RXF9SIDL_EID16_LENGTH                    equ 0001h
RXF9SIDL_EID16_MASK                      equ 0001h
RXF9SIDL_EID17_POSN                      equ 0001h
RXF9SIDL_EID17_POSITION                  equ 0001h
RXF9SIDL_EID17_SIZE                      equ 0001h
RXF9SIDL_EID17_LENGTH                    equ 0001h
RXF9SIDL_EID17_MASK                      equ 0002h
RXF9SIDL_EXIDEN_POSN                     equ 0003h
RXF9SIDL_EXIDEN_POSITION                 equ 0003h
RXF9SIDL_EXIDEN_SIZE                     equ 0001h
RXF9SIDL_EXIDEN_LENGTH                   equ 0001h
RXF9SIDL_EXIDEN_MASK                     equ 0008h
RXF9SIDL_SID0_POSN                       equ 0005h
RXF9SIDL_SID0_POSITION                   equ 0005h
RXF9SIDL_SID0_SIZE                       equ 0001h
RXF9SIDL_SID0_LENGTH                     equ 0001h
RXF9SIDL_SID0_MASK                       equ 0020h
RXF9SIDL_SID1_POSN                       equ 0006h
RXF9SIDL_SID1_POSITION                   equ 0006h
RXF9SIDL_SID1_SIZE                       equ 0001h
RXF9SIDL_SID1_LENGTH                     equ 0001h
RXF9SIDL_SID1_MASK                       equ 0040h
RXF9SIDL_SID2_POSN                       equ 0007h
RXF9SIDL_SID2_POSITION                   equ 0007h
RXF9SIDL_SID2_SIZE                       equ 0001h
RXF9SIDL_SID2_LENGTH                     equ 0001h
RXF9SIDL_SID2_MASK                       equ 0080h
RXF9SIDL_EXIDE_POSN                      equ 0003h
RXF9SIDL_EXIDE_POSITION                  equ 0003h
RXF9SIDL_EXIDE_SIZE                      equ 0001h
RXF9SIDL_EXIDE_LENGTH                    equ 0001h
RXF9SIDL_EXIDE_MASK                      equ 0008h
RXF9SIDL_RXF9EID16_POSN                  equ 0000h
RXF9SIDL_RXF9EID16_POSITION              equ 0000h
RXF9SIDL_RXF9EID16_SIZE                  equ 0001h
RXF9SIDL_RXF9EID16_LENGTH                equ 0001h
RXF9SIDL_RXF9EID16_MASK                  equ 0001h
RXF9SIDL_RXF9EID17_POSN                  equ 0001h
RXF9SIDL_RXF9EID17_POSITION              equ 0001h
RXF9SIDL_RXF9EID17_SIZE                  equ 0001h
RXF9SIDL_RXF9EID17_LENGTH                equ 0001h
RXF9SIDL_RXF9EID17_MASK                  equ 0002h
RXF9SIDL_RXF9EXIDEN_POSN                 equ 0003h
RXF9SIDL_RXF9EXIDEN_POSITION             equ 0003h
RXF9SIDL_RXF9EXIDEN_SIZE                 equ 0001h
RXF9SIDL_RXF9EXIDEN_LENGTH               equ 0001h
RXF9SIDL_RXF9EXIDEN_MASK                 equ 0008h
RXF9SIDL_RXF9SID0_POSN                   equ 0005h
RXF9SIDL_RXF9SID0_POSITION               equ 0005h
RXF9SIDL_RXF9SID0_SIZE                   equ 0001h
RXF9SIDL_RXF9SID0_LENGTH                 equ 0001h
RXF9SIDL_RXF9SID0_MASK                   equ 0020h
RXF9SIDL_RXF9SID1_POSN                   equ 0006h
RXF9SIDL_RXF9SID1_POSITION               equ 0006h
RXF9SIDL_RXF9SID1_SIZE                   equ 0001h
RXF9SIDL_RXF9SID1_LENGTH                 equ 0001h
RXF9SIDL_RXF9SID1_MASK                   equ 0040h
RXF9SIDL_RXF9SID2_POSN                   equ 0007h
RXF9SIDL_RXF9SID2_POSITION               equ 0007h
RXF9SIDL_RXF9SID2_SIZE                   equ 0001h
RXF9SIDL_RXF9SID2_LENGTH                 equ 0001h
RXF9SIDL_RXF9SID2_MASK                   equ 0080h

// Register: RXF9EIDH
#define RXF9EIDH RXF9EIDH
RXF9EIDH                                 equ 0D72h
// bitfield definitions
RXF9EIDH_EID8_POSN                       equ 0000h
RXF9EIDH_EID8_POSITION                   equ 0000h
RXF9EIDH_EID8_SIZE                       equ 0001h
RXF9EIDH_EID8_LENGTH                     equ 0001h
RXF9EIDH_EID8_MASK                       equ 0001h
RXF9EIDH_EID9_POSN                       equ 0001h
RXF9EIDH_EID9_POSITION                   equ 0001h
RXF9EIDH_EID9_SIZE                       equ 0001h
RXF9EIDH_EID9_LENGTH                     equ 0001h
RXF9EIDH_EID9_MASK                       equ 0002h
RXF9EIDH_EID10_POSN                      equ 0002h
RXF9EIDH_EID10_POSITION                  equ 0002h
RXF9EIDH_EID10_SIZE                      equ 0001h
RXF9EIDH_EID10_LENGTH                    equ 0001h
RXF9EIDH_EID10_MASK                      equ 0004h
RXF9EIDH_EID11_POSN                      equ 0003h
RXF9EIDH_EID11_POSITION                  equ 0003h
RXF9EIDH_EID11_SIZE                      equ 0001h
RXF9EIDH_EID11_LENGTH                    equ 0001h
RXF9EIDH_EID11_MASK                      equ 0008h
RXF9EIDH_EID12_POSN                      equ 0004h
RXF9EIDH_EID12_POSITION                  equ 0004h
RXF9EIDH_EID12_SIZE                      equ 0001h
RXF9EIDH_EID12_LENGTH                    equ 0001h
RXF9EIDH_EID12_MASK                      equ 0010h
RXF9EIDH_EID13_POSN                      equ 0005h
RXF9EIDH_EID13_POSITION                  equ 0005h
RXF9EIDH_EID13_SIZE                      equ 0001h
RXF9EIDH_EID13_LENGTH                    equ 0001h
RXF9EIDH_EID13_MASK                      equ 0020h
RXF9EIDH_EID14_POSN                      equ 0006h
RXF9EIDH_EID14_POSITION                  equ 0006h
RXF9EIDH_EID14_SIZE                      equ 0001h
RXF9EIDH_EID14_LENGTH                    equ 0001h
RXF9EIDH_EID14_MASK                      equ 0040h
RXF9EIDH_EID15_POSN                      equ 0007h
RXF9EIDH_EID15_POSITION                  equ 0007h
RXF9EIDH_EID15_SIZE                      equ 0001h
RXF9EIDH_EID15_LENGTH                    equ 0001h
RXF9EIDH_EID15_MASK                      equ 0080h
RXF9EIDH_RXF9EID8_POSN                   equ 0000h
RXF9EIDH_RXF9EID8_POSITION               equ 0000h
RXF9EIDH_RXF9EID8_SIZE                   equ 0001h
RXF9EIDH_RXF9EID8_LENGTH                 equ 0001h
RXF9EIDH_RXF9EID8_MASK                   equ 0001h
RXF9EIDH_RXF9EID9_POSN                   equ 0001h
RXF9EIDH_RXF9EID9_POSITION               equ 0001h
RXF9EIDH_RXF9EID9_SIZE                   equ 0001h
RXF9EIDH_RXF9EID9_LENGTH                 equ 0001h
RXF9EIDH_RXF9EID9_MASK                   equ 0002h
RXF9EIDH_RXF9EID10_POSN                  equ 0002h
RXF9EIDH_RXF9EID10_POSITION              equ 0002h
RXF9EIDH_RXF9EID10_SIZE                  equ 0001h
RXF9EIDH_RXF9EID10_LENGTH                equ 0001h
RXF9EIDH_RXF9EID10_MASK                  equ 0004h
RXF9EIDH_RXF9EID11_POSN                  equ 0003h
RXF9EIDH_RXF9EID11_POSITION              equ 0003h
RXF9EIDH_RXF9EID11_SIZE                  equ 0001h
RXF9EIDH_RXF9EID11_LENGTH                equ 0001h
RXF9EIDH_RXF9EID11_MASK                  equ 0008h
RXF9EIDH_RXF9EID12_POSN                  equ 0004h
RXF9EIDH_RXF9EID12_POSITION              equ 0004h
RXF9EIDH_RXF9EID12_SIZE                  equ 0001h
RXF9EIDH_RXF9EID12_LENGTH                equ 0001h
RXF9EIDH_RXF9EID12_MASK                  equ 0010h
RXF9EIDH_RXF9EID13_POSN                  equ 0005h
RXF9EIDH_RXF9EID13_POSITION              equ 0005h
RXF9EIDH_RXF9EID13_SIZE                  equ 0001h
RXF9EIDH_RXF9EID13_LENGTH                equ 0001h
RXF9EIDH_RXF9EID13_MASK                  equ 0020h
RXF9EIDH_RXF9EID14_POSN                  equ 0006h
RXF9EIDH_RXF9EID14_POSITION              equ 0006h
RXF9EIDH_RXF9EID14_SIZE                  equ 0001h
RXF9EIDH_RXF9EID14_LENGTH                equ 0001h
RXF9EIDH_RXF9EID14_MASK                  equ 0040h
RXF9EIDH_RXF9EID15_POSN                  equ 0007h
RXF9EIDH_RXF9EID15_POSITION              equ 0007h
RXF9EIDH_RXF9EID15_SIZE                  equ 0001h
RXF9EIDH_RXF9EID15_LENGTH                equ 0001h
RXF9EIDH_RXF9EID15_MASK                  equ 0080h

// Register: RXF9EIDL
#define RXF9EIDL RXF9EIDL
RXF9EIDL                                 equ 0D73h
// bitfield definitions
RXF9EIDL_EID0_POSN                       equ 0000h
RXF9EIDL_EID0_POSITION                   equ 0000h
RXF9EIDL_EID0_SIZE                       equ 0001h
RXF9EIDL_EID0_LENGTH                     equ 0001h
RXF9EIDL_EID0_MASK                       equ 0001h
RXF9EIDL_EID1_POSN                       equ 0001h
RXF9EIDL_EID1_POSITION                   equ 0001h
RXF9EIDL_EID1_SIZE                       equ 0001h
RXF9EIDL_EID1_LENGTH                     equ 0001h
RXF9EIDL_EID1_MASK                       equ 0002h
RXF9EIDL_EID2_POSN                       equ 0002h
RXF9EIDL_EID2_POSITION                   equ 0002h
RXF9EIDL_EID2_SIZE                       equ 0001h
RXF9EIDL_EID2_LENGTH                     equ 0001h
RXF9EIDL_EID2_MASK                       equ 0004h
RXF9EIDL_EID3_POSN                       equ 0003h
RXF9EIDL_EID3_POSITION                   equ 0003h
RXF9EIDL_EID3_SIZE                       equ 0001h
RXF9EIDL_EID3_LENGTH                     equ 0001h
RXF9EIDL_EID3_MASK                       equ 0008h
RXF9EIDL_EID4_POSN                       equ 0004h
RXF9EIDL_EID4_POSITION                   equ 0004h
RXF9EIDL_EID4_SIZE                       equ 0001h
RXF9EIDL_EID4_LENGTH                     equ 0001h
RXF9EIDL_EID4_MASK                       equ 0010h
RXF9EIDL_EID5_POSN                       equ 0005h
RXF9EIDL_EID5_POSITION                   equ 0005h
RXF9EIDL_EID5_SIZE                       equ 0001h
RXF9EIDL_EID5_LENGTH                     equ 0001h
RXF9EIDL_EID5_MASK                       equ 0020h
RXF9EIDL_EID6_POSN                       equ 0006h
RXF9EIDL_EID6_POSITION                   equ 0006h
RXF9EIDL_EID6_SIZE                       equ 0001h
RXF9EIDL_EID6_LENGTH                     equ 0001h
RXF9EIDL_EID6_MASK                       equ 0040h
RXF9EIDL_EID7_POSN                       equ 0007h
RXF9EIDL_EID7_POSITION                   equ 0007h
RXF9EIDL_EID7_SIZE                       equ 0001h
RXF9EIDL_EID7_LENGTH                     equ 0001h
RXF9EIDL_EID7_MASK                       equ 0080h
RXF9EIDL_RXF9EID0_POSN                   equ 0000h
RXF9EIDL_RXF9EID0_POSITION               equ 0000h
RXF9EIDL_RXF9EID0_SIZE                   equ 0001h
RXF9EIDL_RXF9EID0_LENGTH                 equ 0001h
RXF9EIDL_RXF9EID0_MASK                   equ 0001h
RXF9EIDL_RXF9EID1_POSN                   equ 0001h
RXF9EIDL_RXF9EID1_POSITION               equ 0001h
RXF9EIDL_RXF9EID1_SIZE                   equ 0001h
RXF9EIDL_RXF9EID1_LENGTH                 equ 0001h
RXF9EIDL_RXF9EID1_MASK                   equ 0002h
RXF9EIDL_RXF9EID2_POSN                   equ 0002h
RXF9EIDL_RXF9EID2_POSITION               equ 0002h
RXF9EIDL_RXF9EID2_SIZE                   equ 0001h
RXF9EIDL_RXF9EID2_LENGTH                 equ 0001h
RXF9EIDL_RXF9EID2_MASK                   equ 0004h
RXF9EIDL_RXF9EID3_POSN                   equ 0003h
RXF9EIDL_RXF9EID3_POSITION               equ 0003h
RXF9EIDL_RXF9EID3_SIZE                   equ 0001h
RXF9EIDL_RXF9EID3_LENGTH                 equ 0001h
RXF9EIDL_RXF9EID3_MASK                   equ 0008h
RXF9EIDL_RXF9EID4_POSN                   equ 0004h
RXF9EIDL_RXF9EID4_POSITION               equ 0004h
RXF9EIDL_RXF9EID4_SIZE                   equ 0001h
RXF9EIDL_RXF9EID4_LENGTH                 equ 0001h
RXF9EIDL_RXF9EID4_MASK                   equ 0010h
RXF9EIDL_RXF9EID5_POSN                   equ 0005h
RXF9EIDL_RXF9EID5_POSITION               equ 0005h
RXF9EIDL_RXF9EID5_SIZE                   equ 0001h
RXF9EIDL_RXF9EID5_LENGTH                 equ 0001h
RXF9EIDL_RXF9EID5_MASK                   equ 0020h
RXF9EIDL_RXF9EID6_POSN                   equ 0006h
RXF9EIDL_RXF9EID6_POSITION               equ 0006h
RXF9EIDL_RXF9EID6_SIZE                   equ 0001h
RXF9EIDL_RXF9EID6_LENGTH                 equ 0001h
RXF9EIDL_RXF9EID6_MASK                   equ 0040h
RXF9EIDL_RXF9EID7_POSN                   equ 0007h
RXF9EIDL_RXF9EID7_POSITION               equ 0007h
RXF9EIDL_RXF9EID7_SIZE                   equ 0001h
RXF9EIDL_RXF9EID7_LENGTH                 equ 0001h
RXF9EIDL_RXF9EID7_MASK                   equ 0080h

// Register: RXF10SIDH
#define RXF10SIDH RXF10SIDH
RXF10SIDH                                equ 0D74h
// bitfield definitions
RXF10SIDH_SID3_POSN                      equ 0000h
RXF10SIDH_SID3_POSITION                  equ 0000h
RXF10SIDH_SID3_SIZE                      equ 0001h
RXF10SIDH_SID3_LENGTH                    equ 0001h
RXF10SIDH_SID3_MASK                      equ 0001h
RXF10SIDH_SID4_POSN                      equ 0001h
RXF10SIDH_SID4_POSITION                  equ 0001h
RXF10SIDH_SID4_SIZE                      equ 0001h
RXF10SIDH_SID4_LENGTH                    equ 0001h
RXF10SIDH_SID4_MASK                      equ 0002h
RXF10SIDH_SID5_POSN                      equ 0002h
RXF10SIDH_SID5_POSITION                  equ 0002h
RXF10SIDH_SID5_SIZE                      equ 0001h
RXF10SIDH_SID5_LENGTH                    equ 0001h
RXF10SIDH_SID5_MASK                      equ 0004h
RXF10SIDH_SID6_POSN                      equ 0003h
RXF10SIDH_SID6_POSITION                  equ 0003h
RXF10SIDH_SID6_SIZE                      equ 0001h
RXF10SIDH_SID6_LENGTH                    equ 0001h
RXF10SIDH_SID6_MASK                      equ 0008h
RXF10SIDH_SID7_POSN                      equ 0004h
RXF10SIDH_SID7_POSITION                  equ 0004h
RXF10SIDH_SID7_SIZE                      equ 0001h
RXF10SIDH_SID7_LENGTH                    equ 0001h
RXF10SIDH_SID7_MASK                      equ 0010h
RXF10SIDH_SID8_POSN                      equ 0005h
RXF10SIDH_SID8_POSITION                  equ 0005h
RXF10SIDH_SID8_SIZE                      equ 0001h
RXF10SIDH_SID8_LENGTH                    equ 0001h
RXF10SIDH_SID8_MASK                      equ 0020h
RXF10SIDH_SID9_POSN                      equ 0006h
RXF10SIDH_SID9_POSITION                  equ 0006h
RXF10SIDH_SID9_SIZE                      equ 0001h
RXF10SIDH_SID9_LENGTH                    equ 0001h
RXF10SIDH_SID9_MASK                      equ 0040h
RXF10SIDH_SID10_POSN                     equ 0007h
RXF10SIDH_SID10_POSITION                 equ 0007h
RXF10SIDH_SID10_SIZE                     equ 0001h
RXF10SIDH_SID10_LENGTH                   equ 0001h
RXF10SIDH_SID10_MASK                     equ 0080h
RXF10SIDH_RXF10SID3_POSN                 equ 0000h
RXF10SIDH_RXF10SID3_POSITION             equ 0000h
RXF10SIDH_RXF10SID3_SIZE                 equ 0001h
RXF10SIDH_RXF10SID3_LENGTH               equ 0001h
RXF10SIDH_RXF10SID3_MASK                 equ 0001h
RXF10SIDH_RXF10SID4_POSN                 equ 0001h
RXF10SIDH_RXF10SID4_POSITION             equ 0001h
RXF10SIDH_RXF10SID4_SIZE                 equ 0001h
RXF10SIDH_RXF10SID4_LENGTH               equ 0001h
RXF10SIDH_RXF10SID4_MASK                 equ 0002h
RXF10SIDH_RXF10SID5_POSN                 equ 0002h
RXF10SIDH_RXF10SID5_POSITION             equ 0002h
RXF10SIDH_RXF10SID5_SIZE                 equ 0001h
RXF10SIDH_RXF10SID5_LENGTH               equ 0001h
RXF10SIDH_RXF10SID5_MASK                 equ 0004h
RXF10SIDH_RXF10SID6_POSN                 equ 0003h
RXF10SIDH_RXF10SID6_POSITION             equ 0003h
RXF10SIDH_RXF10SID6_SIZE                 equ 0001h
RXF10SIDH_RXF10SID6_LENGTH               equ 0001h
RXF10SIDH_RXF10SID6_MASK                 equ 0008h
RXF10SIDH_RXF10SID7_POSN                 equ 0004h
RXF10SIDH_RXF10SID7_POSITION             equ 0004h
RXF10SIDH_RXF10SID7_SIZE                 equ 0001h
RXF10SIDH_RXF10SID7_LENGTH               equ 0001h
RXF10SIDH_RXF10SID7_MASK                 equ 0010h
RXF10SIDH_RXF10SID8_POSN                 equ 0005h
RXF10SIDH_RXF10SID8_POSITION             equ 0005h
RXF10SIDH_RXF10SID8_SIZE                 equ 0001h
RXF10SIDH_RXF10SID8_LENGTH               equ 0001h
RXF10SIDH_RXF10SID8_MASK                 equ 0020h
RXF10SIDH_RXF10SID9_POSN                 equ 0006h
RXF10SIDH_RXF10SID9_POSITION             equ 0006h
RXF10SIDH_RXF10SID9_SIZE                 equ 0001h
RXF10SIDH_RXF10SID9_LENGTH               equ 0001h
RXF10SIDH_RXF10SID9_MASK                 equ 0040h
RXF10SIDH_RXF10SID10_POSN                equ 0007h
RXF10SIDH_RXF10SID10_POSITION            equ 0007h
RXF10SIDH_RXF10SID10_SIZE                equ 0001h
RXF10SIDH_RXF10SID10_LENGTH              equ 0001h
RXF10SIDH_RXF10SID10_MASK                equ 0080h

