GopalSaraf/Practicals/PSDL/include/proc/pic18lf4480.inc
#define RXB1EID5                         BANKMASK(RXB1EIDL), 5, b
#define RXB1EID6                         BANKMASK(RXB1EIDL), 6, b
#define RXB1EID7                         BANKMASK(RXB1EIDL), 7, b
#define RXB1EID8                         BANKMASK(RXB1EIDH), 0, b
#define RXB1EID9                         BANKMASK(RXB1EIDH), 1, b
#define RXB1EXID                         BANKMASK(RXB1SIDL), 3, b
#define RXB1FILHIT0                      BANKMASK(RXB1CON), 0, b
#define RXB1FILHIT1                      BANKMASK(RXB1CON), 1, b
#define RXB1FILHIT2                      BANKMASK(RXB1CON), 2, b
#define RXB1FILHIT3                      BANKMASK(RXB1CON), 3, b
#define RXB1FILHIT4                      BANKMASK(RXB1CON), 4, b
#define RXB1FUL                          BANKMASK(RXB1CON), 7, b
#define RXB1IF                           BANKMASK(PIR3), 1, a
#define RXB1IP                           BANKMASK(IPR3), 1, a
#define RXB1M0                           BANKMASK(RXB1CON), 5, b
#define RXB1M1                           BANKMASK(RXB1CON), 6, b
#define RXB1OVFL                         BANKMASK(COMSTAT), 6, a
#define RXB1RB0                          BANKMASK(RXB1DLC), 4, b
#define RXB1RB1                          BANKMASK(RXB1DLC), 5, b
#define RXB1RTR                          BANKMASK(RXB1DLC), 6, b
#define RXB1RTRR0                        BANKMASK(RXB1CON), 3, b
#define RXB1RTRRO                        BANKMASK(RXB1CON), 5, b
#define RXB1SID0                         BANKMASK(RXB1SIDL), 5, b
#define RXB1SID1                         BANKMASK(RXB1SIDL), 6, b
#define RXB1SID10                        BANKMASK(RXB1SIDH), 7, b
#define RXB1SID2                         BANKMASK(RXB1SIDL), 7, b
#define RXB1SID3                         BANKMASK(RXB1SIDH), 0, b
#define RXB1SID4                         BANKMASK(RXB1SIDH), 1, b
#define RXB1SID5                         BANKMASK(RXB1SIDH), 2, b
#define RXB1SID6                         BANKMASK(RXB1SIDH), 3, b
#define RXB1SID7                         BANKMASK(RXB1SIDH), 4, b
#define RXB1SID8                         BANKMASK(RXB1SIDH), 5, b
#define RXB1SID9                         BANKMASK(RXB1SIDH), 6, b
#define RXB1SRR                          BANKMASK(RXB1SIDL), 4, b
#define RXBNIE                           BANKMASK(PIE3), 1, a
#define RXBNIF                           BANKMASK(PIR3), 1, a
#define RXBNIP                           BANKMASK(IPR3), 1, a
#define RXBNOVFL                         BANKMASK(COMSTAT), 6, a
#define RXBODBEN                         BANKMASK(RXB0CON), 2, a
#define RXBP                             BANKMASK(COMSTAT), 3, a
#define RXBnIE                           BANKMASK(PIE3), 1, a
#define RXBnIF                           BANKMASK(PIR3), 1, a
#define RXBnIP                           BANKMASK(IPR3), 1, a
#define RXBnOVFL                         BANKMASK(COMSTAT), 6, a
#define RXCKP                            BANKMASK(BAUDCON), 5, a
#define RXDTP                            BANKMASK(BAUDCON), 5, a
#define RXF0EID0                         BANKMASK(RXF0EIDL), 0, b
#define RXF0EID1                         BANKMASK(RXF0EIDL), 1, b
#define RXF0EID10                        BANKMASK(RXF0EIDH), 2, b
#define RXF0EID11                        BANKMASK(RXF0EIDH), 3, b
#define RXF0EID12                        BANKMASK(RXF0EIDH), 4, b
#define RXF0EID13                        BANKMASK(RXF0EIDH), 5, b
#define RXF0EID14                        BANKMASK(RXF0EIDH), 6, b
#define RXF0EID15                        BANKMASK(RXF0EIDH), 7, b
#define RXF0EID16                        BANKMASK(RXF0SIDL), 0, b
#define RXF0EID17                        BANKMASK(RXF0SIDL), 1, b
#define RXF0EID2                         BANKMASK(RXF0EIDL), 2, b
#define RXF0EID3                         BANKMASK(RXF0EIDL), 3, b
#define RXF0EID4                         BANKMASK(RXF0EIDL), 4, b
#define RXF0EID5                         BANKMASK(RXF0EIDL), 5, b
#define RXF0EID6                         BANKMASK(RXF0EIDL), 6, b
#define RXF0EID7                         BANKMASK(RXF0EIDL), 7, b
#define RXF0EID8                         BANKMASK(RXF0EIDH), 0, b
#define RXF0EID9                         BANKMASK(RXF0EIDH), 1, b
#define RXF0EN                           BANKMASK(RXFCON0), 0, b
#define RXF0EXIDEN                       BANKMASK(RXF0SIDL), 3, b
#define RXF0SID0                         BANKMASK(RXF0SIDL), 5, b
#define RXF0SID1                         BANKMASK(RXF0SIDL), 6, b
#define RXF0SID10                        BANKMASK(RXF0SIDH), 7, b
#define RXF0SID2                         BANKMASK(RXF0SIDL), 7, b
#define RXF0SID3                         BANKMASK(RXF0SIDH), 0, b
#define RXF0SID4                         BANKMASK(RXF0SIDH), 1, b
#define RXF0SID5                         BANKMASK(RXF0SIDH), 2, b
#define RXF0SID6                         BANKMASK(RXF0SIDH), 3, b
#define RXF0SID7                         BANKMASK(RXF0SIDH), 4, b
#define RXF0SID8                         BANKMASK(RXF0SIDH), 5, b
#define RXF0SID9                         BANKMASK(RXF0SIDH), 6, b
#define RXF10EID0                        BANKMASK(RXF10EIDL), 0, b
#define RXF10EID1                        BANKMASK(RXF10EIDL), 1, b
#define RXF10EID10                       BANKMASK(RXF10EIDH), 2, b
#define RXF10EID11                       BANKMASK(RXF10EIDH), 3, b
#define RXF10EID12                       BANKMASK(RXF10EIDH), 4, b
#define RXF10EID13                       BANKMASK(RXF10EIDH), 5, b
#define RXF10EID14                       BANKMASK(RXF10EIDH), 6, b
#define RXF10EID15                       BANKMASK(RXF10EIDH), 7, b
#define RXF10EID16                       BANKMASK(RXF10SIDL), 0, b
#define RXF10EID17                       BANKMASK(RXF10SIDL), 1, b
#define RXF10EID2                        BANKMASK(RXF10EIDL), 2, b
#define RXF10EID3                        BANKMASK(RXF10EIDL), 3, b
#define RXF10EID4                        BANKMASK(RXF10EIDL), 4, b
#define RXF10EID5                        BANKMASK(RXF10EIDL), 5, b
#define RXF10EID6                        BANKMASK(RXF10EIDL), 6, b
#define RXF10EID7                        BANKMASK(RXF10EIDL), 7, b
#define RXF10EID8                        BANKMASK(RXF10EIDH), 0, b
#define RXF10EID9                        BANKMASK(RXF10EIDH), 1, b
#define RXF10EN                          BANKMASK(RXFCON1), 2, b
#define RXF10EXIDEN                      BANKMASK(RXF10SIDL), 3, b
#define RXF10SID0                        BANKMASK(RXF10SIDL), 5, b
#define RXF10SID1                        BANKMASK(RXF10SIDL), 6, b
#define RXF10SID10                       BANKMASK(RXF10SIDH), 7, b
#define RXF10SID2                        BANKMASK(RXF10SIDL), 7, b
#define RXF10SID3                        BANKMASK(RXF10SIDH), 0, b
#define RXF10SID4                        BANKMASK(RXF10SIDH), 1, b
#define RXF10SID5                        BANKMASK(RXF10SIDH), 2, b
#define RXF10SID6                        BANKMASK(RXF10SIDH), 3, b
#define RXF10SID7                        BANKMASK(RXF10SIDH), 4, b
#define RXF10SID8                        BANKMASK(RXF10SIDH), 5, b
#define RXF10SID9                        BANKMASK(RXF10SIDH), 6, b
#define RXF11EID0                        BANKMASK(RXF11EIDL), 0, b
#define RXF11EID1                        BANKMASK(RXF11EIDL), 1, b
#define RXF11EID10                       BANKMASK(RXF11EIDH), 2, b
#define RXF11EID11                       BANKMASK(RXF11EIDH), 3, b
#define RXF11EID12                       BANKMASK(RXF11EIDH), 4, b
#define RXF11EID13                       BANKMASK(RXF11EIDH), 5, b
#define RXF11EID14                       BANKMASK(RXF11EIDH), 6, b
#define RXF11EID15                       BANKMASK(RXF11EIDH), 7, b
#define RXF11EID16                       BANKMASK(RXF11SIDL), 0, b
#define RXF11EID17                       BANKMASK(RXF11SIDL), 1, b
#define RXF11EID2                        BANKMASK(RXF11EIDL), 2, b
#define RXF11EID3                        BANKMASK(RXF11EIDL), 3, b
#define RXF11EID4                        BANKMASK(RXF11EIDL), 4, b
#define RXF11EID5                        BANKMASK(RXF11EIDL), 5, b
#define RXF11EID6                        BANKMASK(RXF11EIDL), 6, b
#define RXF11EID7                        BANKMASK(RXF11EIDL), 7, b
#define RXF11EID8                        BANKMASK(RXF11EIDH), 0, b
#define RXF11EID9                        BANKMASK(RXF11EIDH), 1, b
#define RXF11EN                          BANKMASK(RXFCON1), 3, b
#define RXF11EXIDEN                      BANKMASK(RXF11SIDL), 3, b
#define RXF11SID0                        BANKMASK(RXF11SIDL), 5, b
#define RXF11SID1                        BANKMASK(RXF11SIDL), 6, b
#define RXF11SID10                       BANKMASK(RXF11SIDH), 7, b
#define RXF11SID2                        BANKMASK(RXF11SIDL), 7, b
#define RXF11SID3                        BANKMASK(RXF11SIDH), 0, b
#define RXF11SID4                        BANKMASK(RXF11SIDH), 1, b
#define RXF11SID5                        BANKMASK(RXF11SIDH), 2, b
#define RXF11SID6                        BANKMASK(RXF11SIDH), 3, b
#define RXF11SID7                        BANKMASK(RXF11SIDH), 4, b
#define RXF11SID8                        BANKMASK(RXF11SIDH), 5, b
#define RXF11SID9                        BANKMASK(RXF11SIDH), 6, b
#define RXF12EID0                        BANKMASK(RXF12EIDL), 0, b
#define RXF12EID1                        BANKMASK(RXF12EIDL), 1, b
#define RXF12EID10                       BANKMASK(RXF12EIDH), 2, b
#define RXF12EID11                       BANKMASK(RXF12EIDH), 3, b
#define RXF12EID12                       BANKMASK(RXF12EIDH), 4, b
#define RXF12EID13                       BANKMASK(RXF12EIDH), 5, b
#define RXF12EID14                       BANKMASK(RXF12EIDH), 6, b
#define RXF12EID15                       BANKMASK(RXF12EIDH), 7, b
#define RXF12EID16                       BANKMASK(RXF12SIDL), 0, b
#define RXF12EID17                       BANKMASK(RXF12SIDL), 1, b
#define RXF12EID2                        BANKMASK(RXF12EIDL), 2, b
#define RXF12EID3                        BANKMASK(RXF12EIDL), 3, b
#define RXF12EID4                        BANKMASK(RXF12EIDL), 4, b
#define RXF12EID5                        BANKMASK(RXF12EIDL), 5, b
#define RXF12EID6                        BANKMASK(RXF12EIDL), 6, b
#define RXF12EID7                        BANKMASK(RXF12EIDL), 7, b
#define RXF12EID8                        BANKMASK(RXF12EIDH), 0, b
#define RXF12EID9                        BANKMASK(RXF12EIDH), 1, b
#define RXF12EN                          BANKMASK(RXFCON1), 4, b
#define RXF12EXIDEN                      BANKMASK(RXF12SIDL), 3, b
#define RXF12SID0                        BANKMASK(RXF12SIDL), 5, b
#define RXF12SID1                        BANKMASK(RXF12SIDL), 6, b
#define RXF12SID10                       BANKMASK(RXF12SIDH), 7, b
#define RXF12SID2                        BANKMASK(RXF12SIDL), 7, b
#define RXF12SID3                        BANKMASK(RXF12SIDH), 0, b
#define RXF12SID4                        BANKMASK(RXF12SIDH), 1, b
#define RXF12SID5                        BANKMASK(RXF12SIDH), 2, b
#define RXF12SID6                        BANKMASK(RXF12SIDH), 3, b
#define RXF12SID7                        BANKMASK(RXF12SIDH), 4, b
#define RXF12SID8                        BANKMASK(RXF12SIDH), 5, b
#define RXF12SID9                        BANKMASK(RXF12SIDH), 6, b
#define RXF13EID0                        BANKMASK(RXF13EIDL), 0, b
#define RXF13EID1                        BANKMASK(RXF13EIDL), 1, b
#define RXF13EID10                       BANKMASK(RXF13EIDH), 2, b
#define RXF13EID11                       BANKMASK(RXF13EIDH), 3, b
#define RXF13EID12                       BANKMASK(RXF13EIDH), 4, b
#define RXF13EID13                       BANKMASK(RXF13EIDH), 5, b
#define RXF13EID14                       BANKMASK(RXF13EIDH), 6, b
#define RXF13EID15                       BANKMASK(RXF13EIDH), 7, b
#define RXF13EID16                       BANKMASK(RXF13SIDL), 0, b
#define RXF13EID17                       BANKMASK(RXF13SIDL), 1, b
#define RXF13EID2                        BANKMASK(RXF13EIDL), 2, b
#define RXF13EID3                        BANKMASK(RXF13EIDL), 3, b
#define RXF13EID4                        BANKMASK(RXF13EIDL), 4, b
#define RXF13EID5                        BANKMASK(RXF13EIDL), 5, b
#define RXF13EID6                        BANKMASK(RXF13EIDL), 6, b
#define RXF13EID7                        BANKMASK(RXF13EIDL), 7, b
#define RXF13EID8                        BANKMASK(RXF13EIDH), 0, b
#define RXF13EID9                        BANKMASK(RXF13EIDH), 1, b
#define RXF13EN                          BANKMASK(RXFCON1), 5, b
#define RXF13EXIDEN                      BANKMASK(RXF13SIDL), 3, b
#define RXF13SID0                        BANKMASK(RXF13SIDL), 5, b
#define RXF13SID1                        BANKMASK(RXF13SIDL), 6, b
#define RXF13SID10                       BANKMASK(RXF13SIDH), 7, b
#define RXF13SID2                        BANKMASK(RXF13SIDL), 7, b
#define RXF13SID3                        BANKMASK(RXF13SIDH), 0, b
#define RXF13SID4                        BANKMASK(RXF13SIDH), 1, b
#define RXF13SID5                        BANKMASK(RXF13SIDH), 2, b
#define RXF13SID6                        BANKMASK(RXF13SIDH), 3, b
#define RXF13SID7                        BANKMASK(RXF13SIDH), 4, b
#define RXF13SID8                        BANKMASK(RXF13SIDH), 5, b
#define RXF13SID9                        BANKMASK(RXF13SIDH), 6, b
#define RXF14EID0                        BANKMASK(RXF14EIDL), 0, b
#define RXF14EID1                        BANKMASK(RXF14EIDL), 1, b
#define RXF14EID10                       BANKMASK(RXF14EIDH), 2, b
#define RXF14EID11                       BANKMASK(RXF14EIDH), 3, b
#define RXF14EID12                       BANKMASK(RXF14EIDH), 4, b
#define RXF14EID13                       BANKMASK(RXF14EIDH), 5, b
#define RXF14EID14                       BANKMASK(RXF14EIDH), 6, b
#define RXF14EID15                       BANKMASK(RXF14EIDH), 7, b
#define RXF14EID16                       BANKMASK(RXF14SIDL), 0, b
#define RXF14EID17                       BANKMASK(RXF14SIDL), 1, b
#define RXF14EID2                        BANKMASK(RXF14EIDL), 2, b
#define RXF14EID3                        BANKMASK(RXF14EIDL), 3, b
#define RXF14EID4                        BANKMASK(RXF14EIDL), 4, b
#define RXF14EID5                        BANKMASK(RXF14EIDL), 5, b
#define RXF14EID6                        BANKMASK(RXF14EIDL), 6, b
#define RXF14EID7                        BANKMASK(RXF14EIDL), 7, b
#define RXF14EID8                        BANKMASK(RXF14EIDH), 0, b
#define RXF14EID9                        BANKMASK(RXF14EIDH), 1, b
#define RXF14EN                          BANKMASK(RXFCON1), 6, b
#define RXF14EXIDEN                      BANKMASK(RXF14SIDL), 3, b
#define RXF14SID0                        BANKMASK(RXF14SIDL), 5, b
#define RXF14SID1                        BANKMASK(RXF14SIDL), 6, b
#define RXF14SID10                       BANKMASK(RXF14SIDH), 7, b
#define RXF14SID2                        BANKMASK(RXF14SIDL), 7, b
#define RXF14SID3                        BANKMASK(RXF14SIDH), 0, b
#define RXF14SID4                        BANKMASK(RXF14SIDH), 1, b
#define RXF14SID5                        BANKMASK(RXF14SIDH), 2, b
#define RXF14SID6                        BANKMASK(RXF14SIDH), 3, b
#define RXF14SID7                        BANKMASK(RXF14SIDH), 4, b
#define RXF14SID8                        BANKMASK(RXF14SIDH), 5, b
#define RXF14SID9                        BANKMASK(RXF14SIDH), 6, b
#define RXF15EID0                        BANKMASK(RXF15EIDL), 0, b
#define RXF15EID1                        BANKMASK(RXF15EIDL), 1, b
#define RXF15EID10                       BANKMASK(RXF15EIDH), 2, b
#define RXF15EID11                       BANKMASK(RXF15EIDH), 3, b
#define RXF15EID12                       BANKMASK(RXF15EIDH), 4, b
#define RXF15EID13                       BANKMASK(RXF15EIDH), 5, b
#define RXF15EID14                       BANKMASK(RXF15EIDH), 6, b
#define RXF15EID15                       BANKMASK(RXF15EIDH), 7, b
#define RXF15EID16                       BANKMASK(RXF15SIDL), 0, b
#define RXF15EID17                       BANKMASK(RXF15SIDL), 1, b
#define RXF15EID2                        BANKMASK(RXF15EIDL), 2, b
#define RXF15EID3                        BANKMASK(RXF15EIDL), 3, b
#define RXF15EID4                        BANKMASK(RXF15EIDL), 4, b
#define RXF15EID5                        BANKMASK(RXF15EIDL), 5, b
#define RXF15EID6                        BANKMASK(RXF15EIDL), 6, b
#define RXF15EID7                        BANKMASK(RXF15EIDL), 7, b
#define RXF15EID8                        BANKMASK(RXF15EIDH), 0, b
#define RXF15EID9                        BANKMASK(RXF15EIDH), 1, b
#define RXF15EN                          BANKMASK(RXFCON1), 7, b
#define RXF15EXIDEN                      BANKMASK(RXF15SIDL), 3, b
#define RXF15SID0                        BANKMASK(RXF15SIDL), 5, b
#define RXF15SID1                        BANKMASK(RXF15SIDL), 6, b
#define RXF15SID10                       BANKMASK(RXF15SIDH), 7, b
#define RXF15SID2                        BANKMASK(RXF15SIDL), 7, b
#define RXF15SID3                        BANKMASK(RXF15SIDH), 0, b
#define RXF15SID4                        BANKMASK(RXF15SIDH), 1, b
#define RXF15SID5                        BANKMASK(RXF15SIDH), 2, b
#define RXF15SID6                        BANKMASK(RXF15SIDH), 3, b
#define RXF15SID7                        BANKMASK(RXF15SIDH), 4, b
#define RXF15SID8                        BANKMASK(RXF15SIDH), 5, b
#define RXF15SID9                        BANKMASK(RXF15SIDH), 6, b
#define RXF1EID0                         BANKMASK(RXF1EIDL), 0, b
#define RXF1EID1                         BANKMASK(RXF1EIDL), 1, b
#define RXF1EID10                        BANKMASK(RXF1EIDH), 2, b
#define RXF1EID11                        BANKMASK(RXF1EIDH), 3, b
#define RXF1EID12                        BANKMASK(RXF1EIDH), 4, b
#define RXF1EID13                        BANKMASK(RXF1EIDH), 5, b
#define RXF1EID14                        BANKMASK(RXF1EIDH), 6, b
#define RXF1EID15                        BANKMASK(RXF1EIDH), 7, b
#define RXF1EID16                        BANKMASK(RXF1SIDL), 0, b
#define RXF1EID17                        BANKMASK(RXF1SIDL), 1, b
#define RXF1EID2                         BANKMASK(RXF1EIDL), 2, b
#define RXF1EID3                         BANKMASK(RXF1EIDL), 3, b
#define RXF1EID4                         BANKMASK(RXF1EIDL), 4, b
#define RXF1EID5                         BANKMASK(RXF1EIDL), 5, b
#define RXF1EID6                         BANKMASK(RXF1EIDL), 6, b
#define RXF1EID7                         BANKMASK(RXF1EIDL), 7, b
#define RXF1EID8                         BANKMASK(RXF1EIDH), 0, b
#define RXF1EID9                         BANKMASK(RXF1EIDH), 1, b
#define RXF1EN                           BANKMASK(RXFCON0), 1, b
#define RXF1EXIDEN                       BANKMASK(RXF1SIDL), 3, b
#define RXF1SID0                         BANKMASK(RXF1SIDL), 5, b
#define RXF1SID1                         BANKMASK(RXF1SIDL), 6, b
#define RXF1SID10                        BANKMASK(RXF1SIDH), 7, b
#define RXF1SID2                         BANKMASK(RXF1SIDL), 7, b
#define RXF1SID3                         BANKMASK(RXF1SIDH), 0, b
#define RXF1SID4                         BANKMASK(RXF1SIDH), 1, b
#define RXF1SID5                         BANKMASK(RXF1SIDH), 2, b
#define RXF1SID6                         BANKMASK(RXF1SIDH), 3, b
#define RXF1SID7                         BANKMASK(RXF1SIDH), 4, b
#define RXF1SID8                         BANKMASK(RXF1SIDH), 5, b
#define RXF1SID9                         BANKMASK(RXF1SIDH), 6, b
#define RXF2EID0                         BANKMASK(RXF2EIDL), 0, b
#define RXF2EID1                         BANKMASK(RXF2EIDL), 1, b
#define RXF2EID10                        BANKMASK(RXF2EIDH), 2, b
#define RXF2EID11                        BANKMASK(RXF2EIDH), 3, b
#define RXF2EID12                        BANKMASK(RXF2EIDH), 4, b
#define RXF2EID13                        BANKMASK(RXF2EIDH), 5, b
#define RXF2EID14                        BANKMASK(RXF2EIDH), 6, b
#define RXF2EID15                        BANKMASK(RXF2EIDH), 7, b
#define RXF2EID16                        BANKMASK(RXF2SIDL), 0, b
#define RXF2EID17                        BANKMASK(RXF2SIDL), 1, b
#define RXF2EID2                         BANKMASK(RXF2EIDL), 2, b
#define RXF2EID3                         BANKMASK(RXF2EIDL), 3, b
#define RXF2EID4                         BANKMASK(RXF2EIDL), 4, b
#define RXF2EID5                         BANKMASK(RXF2EIDL), 5, b
#define RXF2EID6                         BANKMASK(RXF2EIDL), 6, b
#define RXF2EID7                         BANKMASK(RXF2EIDL), 7, b
#define RXF2EID8                         BANKMASK(RXF2EIDH), 0, b
#define RXF2EID9                         BANKMASK(RXF2EIDH), 1, b
#define RXF2EN                           BANKMASK(RXFCON0), 2, b
#define RXF2EXIDEN                       BANKMASK(RXF2SIDL), 3, b
#define RXF2SID0                         BANKMASK(RXF2SIDL), 5, b
#define RXF2SID1                         BANKMASK(RXF2SIDL), 6, b
#define RXF2SID10                        BANKMASK(RXF2SIDH), 7, b
#define RXF2SID2                         BANKMASK(RXF2SIDL), 7, b
#define RXF2SID3                         BANKMASK(RXF2SIDH), 0, b
#define RXF2SID4                         BANKMASK(RXF2SIDH), 1, b
#define RXF2SID5                         BANKMASK(RXF2SIDH), 2, b
#define RXF2SID6                         BANKMASK(RXF2SIDH), 3, b
#define RXF2SID7                         BANKMASK(RXF2SIDH), 4, b
#define RXF2SID8                         BANKMASK(RXF2SIDH), 5, b
#define RXF2SID9                         BANKMASK(RXF2SIDH), 6, b
#define RXF3EID0                         BANKMASK(RXF3EIDL), 0, b
#define RXF3EID1                         BANKMASK(RXF3EIDL), 1, b
#define RXF3EID10                        BANKMASK(RXF3EIDH), 2, b
#define RXF3EID11                        BANKMASK(RXF3EIDH), 3, b
#define RXF3EID12                        BANKMASK(RXF3EIDH), 4, b
#define RXF3EID13                        BANKMASK(RXF3EIDH), 5, b
#define RXF3EID14                        BANKMASK(RXF3EIDH), 6, b
#define RXF3EID15                        BANKMASK(RXF3EIDH), 7, b
#define RXF3EID16                        BANKMASK(RXF3SIDL), 0, b
#define RXF3EID17                        BANKMASK(RXF3SIDL), 1, b
#define RXF3EID2                         BANKMASK(RXF3EIDL), 2, b
#define RXF3EID3                         BANKMASK(RXF3EIDL), 3, b
#define RXF3EID4                         BANKMASK(RXF3EIDL), 4, b
#define RXF3EID5                         BANKMASK(RXF3EIDL), 5, b
#define RXF3EID6                         BANKMASK(RXF3EIDL), 6, b
#define RXF3EID7                         BANKMASK(RXF3EIDL), 7, b
#define RXF3EID8                         BANKMASK(RXF3EIDH), 0, b
#define RXF3EID9                         BANKMASK(RXF3EIDH), 1, b
#define RXF3EN                           BANKMASK(RXFCON0), 3, b
#define RXF3EXIDEN                       BANKMASK(RXF3SIDL), 3, b
#define RXF3SID0                         BANKMASK(RXF3SIDL), 5, b
#define RXF3SID1                         BANKMASK(RXF3SIDL), 6, b
#define RXF3SID10                        BANKMASK(RXF3SIDH), 7, b
#define RXF3SID2                         BANKMASK(RXF3SIDL), 7, b
#define RXF3SID3                         BANKMASK(RXF3SIDH), 0, b
#define RXF3SID4                         BANKMASK(RXF3SIDH), 1, b
#define RXF3SID5                         BANKMASK(RXF3SIDH), 2, b
#define RXF3SID6                         BANKMASK(RXF3SIDH), 3, b
#define RXF3SID7                         BANKMASK(RXF3SIDH), 4, b
#define RXF3SID8                         BANKMASK(RXF3SIDH), 5, b
#define RXF3SID9                         BANKMASK(RXF3SIDH), 6, b
#define RXF4EID0                         BANKMASK(RXF4EIDL), 0, b
#define RXF4EID1                         BANKMASK(RXF4EIDL), 1, b
#define RXF4EID10                        BANKMASK(RXF4EIDH), 2, b
#define RXF4EID11                        BANKMASK(RXF4EIDH), 3, b
#define RXF4EID12                        BANKMASK(RXF4EIDH), 4, b
